[
    {
        "post_title": "[Weekly Megathread] Markets and Value Stock Ideas, Week of April 29, 2024",
        "post_date": "2024-04-29T00:00:15",
        "post_body": "What stocks are on your radar this week?\n\nWhat's in the news that's affecting the market?\n\nCelebrate your successes, rue your losses, or just chat with your fellow Value redditors!\n\nTake everything here with a grain of salt! We suggest checking other users' posting/commenting history before following advice or stock recommendations.  Watch out for shill accounts that pump the same stock all over Reddit, or have many posts/comments deleted in other investing subreddits. Stay safe!\n\n*(New Weekly Megathreads are posted every Monday at 0600 GMT.)*",
        "relevant_tickers": [],
        "comments": [
            {
                "comment_date": "2024-04-29T00:19:54",
                "comment_body": "CCB. It's a bank stock that plays the BaaS game, and is making an increasing portion of revenue from non interest sources. 500M market cap based out of the Washington area. The bank has good management and the launching of the BaaS service has supercharged growth in the business.",
                "relevant_tickers": [
                    "CCB"
                ]
            }
        ]
    },
    {
        "post_title": "Large-Growth Stocks Are Overvalued. Small-Value Stocks Are Undervalued",
        "post_date": "2024-04-28T09:54:04",
        "post_body": "The most important takeaway is that valuations are a proxy for long-term expected returns. Thus, being mindful of them should lead to better outcomes. At the same time, we must recognize that over the short term, valuations have little predictive value as to returns.\n\nhttps://www.morningstar.com/portfolios/large-growth-stocks-are-overvalued-small-value-stocks-are-undervalued-heres-why-it-matters",
        "relevant_tickers": [],
        "comments": [
            {
                "comment_date": "2024-04-28T10:25:14",
                "comment_body": "I'm in both. Come at me, market.\n\nThough it didn't happen deliberately. Turns out some good companies are large cap growth, other good companies are small cap value. Just turned out that way.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T12:35:22",
                "comment_body": "Google is about fairly valued after Q1 earnings. Amazon is still undervalued. A company with a 1,9 trillion market cap is not expensive if they generate 100 billion in FCF.\n\nBuy Amazon and never sell. You won't regret it.",
                "relevant_tickers": [
                    "FCF"
                ]
            },
            {
                "comment_date": "2024-04-28T13:51:36",
                "comment_body": "Im almost exclusively in nano, micro, and small caps. The value discrepancy is borderline unbelievable. Good luck finding a growing large cap tech company that trades under 1.0 P/S.\n\nAfter being in these for a couple years I’ve also noticed they’re subject to huge moves based on cyclical capital rotations. I’ll buy something cheap and may have to wait a year, but it’ll go up 200% in a few months for seemingly no real reason.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T17:50:59",
                "comment_body": "Only NVDA probably is overvalued",
                "relevant_tickers": [
                    "NVDA"
                ]
            },
            {
                "comment_date": "2024-04-28T11:32:07",
                "comment_body": "Clarivate",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T19:01:15",
                "comment_body": "I feel we have to factor in the financial strength, indicated by credit rating for example, when talking about value. Otherwise, it's meaningless. Stocks from lowly rated companies should be cheaper than a stronger company.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T20:22:19",
                "comment_body": "Market cap doesn't really matter. A 100 million dollar stock can be just as undervalued as a 100 billion dollar stock. The difference is that large caps are generally less likely to be undervalued, but when they are, you bet your ass I'm buying in.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-29T00:57:09",
                "comment_body": "Small value stocks are always undervalued, that's why they're called small value lol",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T10:22:20",
                "comment_body": "[deleted]",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T12:02:17",
                "comment_body": "Thanks.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T10:15:19",
                "comment_body": "So what?....",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T10:02:22",
                "comment_body": "No. Yes.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T21:38:39",
                "comment_body": "WW 3 incoming.",
                "relevant_tickers": [
                    "WW"
                ]
            },
            {
                "comment_date": "2024-04-28T17:15:46",
                "comment_body": "...Where do you see 100 billion in FCF? You have to take into account capex.",
                "relevant_tickers": [
                    "FCF"
                ]
            },
            {
                "comment_date": "2024-04-28T13:07:04",
                "comment_body": "What is the biggest threat to Amazon’s growth?",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T14:50:05",
                "comment_body": "Care to list out the tickers of what you own?",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T15:22:49",
                "comment_body": "I'll second teh request for some good tickers that you own. Always on the lookout for good deals and future growth.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T17:11:59",
                "comment_body": "There's no such thing as a cyclical rotation. Once it goes up it might not go down again, leaving someone with your logic unable to get in again. You sounds like a crypto bro who \"study\" crypto curves.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T18:22:59",
                "comment_body": "Why? Too much debt - no growth.   [https://userupload.gurufocus.com/1784725027443339264.png](https://userupload.gurufocus.com/1784725027443339264.png)",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T19:30:57",
                "comment_body": "🫨",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T10:23:23",
                "comment_body": "\"people in the comments\"\n\nthe two comments:  \n\"No. Yes.\"  \n\"So what?....\"\n\nWho are you talking about?",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T12:02:10",
                "comment_body": "What I gathered from the article is that these big, well known companies with a price to book are well over valued and a correction is coming.  Because so many people have their money in the Majestics, the little companies are unsung and unloved and due for a boost.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T23:30:57",
                "comment_body": "I don't get the feeling that the big players feel like it right now.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T17:52:25",
                "comment_body": "It's not there on paper yet but it will be in 2025. Look at their margins in retail. Now look at the margins for let's say FedEx or Walmart. Now extrapolate total revenue in Amazons retail, while running Walmart margins. Then include revenue growth. It's honestly insane the FCF numbers you come up with. \n\nCloud is already a big cash cow and still growing double digit + accelerating with new AI demand. Prime has only just starten generating serious Adversing revenue and it's highly profitable. Prime video subscriptions are growing fast and they still have lots of room to grow revenue there due to their aggressive pricing point atm to compete with Netflix and Disney.\n\nCapex is investing in future cashflows so that's a good thing.",
                "relevant_tickers": [
                    "AI",
                    "FCF"
                ]
            },
            {
                "comment_date": "2024-04-28T13:12:29",
                "comment_body": "Hate to sound like a fan boy, but there isn't one really. They are leading cloud by a long shot and cloud is accelerating (see MSFT/GOOGL numbers). Their retail business is a proxy for US consumer spending and that's not dropping anytime soon. Margins are growing, Capex is slowing. Their advertising business and Prime memberships are growing 25-30% and is not priced in at all.\n\nAMZN could be considered an ETF because of sheer scale and diversification. Largest position (AMZN + GOOGL = 50% of portfolio) and I can't find any reason to doubt their growth continuing as is for the foreseeable future.\n\nThe moat around both companies is insanely large. Basically no competition except for the big 3 against each other.",
                "relevant_tickers": [
                    "MSFT",
                    "GOOGL",
                    "AMZN"
                ]
            },
            {
                "comment_date": "2024-04-28T15:27:07",
                "comment_body": "Lately I’ve been buying VRME and BCBNF. Slowed down on buying VRME because it’s gone from $1.08 to $1.67 really fast. Just starting my position in BCBNF.\n\nI own DTST but not buying currently unless it gets cheaper. Rode that one from $1.75 up to almost $8 and now back down to $5.\n\nJust bought GRRR on Friday because it looks primed for a bounce but I may get out quickly as I’m somewhat skeptical of them. I’m more confident in the above tickers.\n\nI’ll also add AQST, small cap bio I’m bullish on for a film strip epinephrine treatment that could replace the epipen. They just had a different drug approved on Friday, Libervant.",
                "relevant_tickers": [
                    "VRME",
                    "DTST",
                    "GRRR",
                    "AQST"
                ]
            },
            {
                "comment_date": "2024-04-28T17:15:00",
                "comment_body": "Last quarter ended and money flowed out of tech and into energy. Sectors come in and out of style. Is this false?\n\nI’m saying buy good businesses that will do well when they’re cheap. Getting lucky with big money flows into small caps is just a bonus.\n\nWhat’s with the rudeness?",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T18:32:22",
                "comment_body": "Wide moat high barrier to entry, approaching consistent profitability, possible m&a target for a bigger player (relx, or maybe a private player), well below ipo, recent exor stake, looks cheap rn I expect quite a bit of upside and will gladly buy more lower",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T20:06:14",
                "comment_body": "Sorry I might have stated the obvious in the previous comment. But the devil is in the details. How do you objectively and consistently measure and compare the financial strength of companies? Happy to hear your thoughts.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T14:16:06",
                "comment_body": "That's what they've been saying for 15 years",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T19:32:10",
                "comment_body": "Interesting. Their margins are insane! However, I'm getting a \\~8.50% ROIC which is low. I'm not an accountant, but I assume it's low because how much they reinvest and that's reflected in InvestedCapital (when calculating ROIC). I wonder what their 'true' ROIC looks like.\n\nHowever, it would only be fair to look at companies like GOOG the same way and deduct the value they give back to shareholders through buybacks and now the dividend. Just as you seek to deduct the reinvested capital of AMZN.\n\nAnd another thought...\n\nIf you felt it were significantly undervalued using P/FCF if they didn't re-invest so much, wouldn't EV/EBITDA tell the story better then? They're standing at \\~23 EV/EBITDA, which is significantly higher than GOOG (19 ev/ebitda) and META (16 ev/ebitda).\n\nI don't disagree. I'm just throwing some thoughts at you.",
                "relevant_tickers": [
                    "FCF",
                    "GOOG",
                    "ROIC",
                    "AMZN",
                    "META"
                ]
            },
            {
                "comment_date": "2024-04-28T13:28:25",
                "comment_body": "You’ve definitely done your research and I have to agree with your points; they are an absolute behemoth. Thanks for the run down homie.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T17:14:01",
                "comment_body": "Love the bullishness. 40% of my portfolio is AMZN and MSFT",
                "relevant_tickers": [
                    "MSFT",
                    "AMZN"
                ]
            },
            {
                "comment_date": "2024-04-28T13:28:59",
                "comment_body": "What is the cloud moat for Amazon?\n\nI guess I mean what specifically will keep their customers from changing providers if/when a cheaper provider emerges?",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T19:20:45",
                "comment_body": "Interesting.  FCF is pretty healthy.  Insiders are buying.",
                "relevant_tickers": [
                    "FCF"
                ]
            },
            {
                "comment_date": "2024-04-28T14:40:47",
                "comment_body": "Maybe, just maybe, looking at PE and PB alone is not sufficient to spot a good investment.",
                "relevant_tickers": [
                    "PB"
                ]
            },
            {
                "comment_date": "2024-04-28T15:19:11",
                "comment_body": "AWS server capacity is 6x larger than Azure, Google Cloud and the next 10 competitors *combined* Scale is a moat in itself. They also offer the largest amount of available cloud services, more than Azure. Biggest reason is switching costs. Once an organisation is embedded into a cloud provider it's next to impossible to migrate, even if a competitor would be cheaper. The costs of switching and workload a company would put onto their network engineers is not worth it for 95% of cloud users.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T19:28:44",
                "comment_body": "Fluence looks interesting too for many of the same reasons.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T17:20:33",
                "comment_body": "Never said they were.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T15:54:25",
                "comment_body": "Lots of examples in history of companies with massive scale and/or share advantage being out innovated over time.  Tech change can see a shift in cost or benefit and first mover / scale advantage can be gone quickly, especially if the scale is based upon short lived investments that face a short obsolescence cycle and need replacement - like IT hardware.\n\nAt one time people thought there was no alternative to IBM.  Operational cost from scale is not a long term moat.  First mover is an advantage only if it blocks competitors out - which in history has been a geographic or network effect story.\n\nPeople don’t switch from Apple ecosystem because of what they would lose.  Facebook has a similar network effect advantage.  Msft has high barriers to change because all the devs would need retraining to move away from Msft enterprise.  Google is at risk but there is an intersection of tools and monopoly that make it the gorilla you HAVE to work with.  All of these tech companies are actively working to leverage their strengths to defend their moats and make them stronger and integrate with AI.\n\nIs there anything similar wrt AWS?  Network effects?  Lots of investment on their customers side that would have to be redone?  An obvious pathway to staying ahead of the surprise innovation out of left field that takes out the scale advantage?\n\nI get the arguments on the shopping portal side, but that business has not been terribly profitable in history.  I don’t see where the durable moat is wrt an industry (cloud compute) that is racing towards commodification with competition that can afford to sell cloud at a loss because of the benefit they get from integration with all of their other datasets and services.\n\nAny high margin business attracts competition.  Everyone races to innovate and in the process prices tend to crater.  Eventually it becomes a commodity market.\n\nI’m not trying to prove you wrong, I’m genuinely trying to understand this idea that Amazon has a durable moat.  Is it some sort of proprietary container code that can’t be replicated?  Is there some specialized knowledge and an army of workers that would need retraining?  Is there a patent that gives Amazon a durable cost advantage?  Why would companies (cloud customers) be willing give their supplier strategic pricing power over their bottom line?  What is stopping a lower cost producer from taking share with better operational tech?\n\nI’ve heard this idea that all the aws container code would have to be rewritten.  Why couldn’t an LLM do that?\n\nWhat is preventing competition from taking business from Amazon?  What will prevent commodification?",
                "relevant_tickers": [
                    "AI",
                    "IBM",
                    "IT"
                ]
            },
            {
                "comment_date": "2024-04-28T17:32:26",
                "comment_body": "I mean you can do this about any company on the market... \"Yeah but what about risk x, or maybe in 10 years x happens, or why would x not steal their market\". People have written bear thesises on Amazon for 20 years. Look what they have become. Amazon is a very misunderstood company and people underestimate the near-impossibility of penetrating their moat. \"If you can't see it, don't buy it\" is something I always use when discussing Amazon and Google. \n\nI'm 100% convinced they have broken economics/capitalism. Not in the sense that they're gonna collapse the system, no, in the sense that they have achieved such an immense size and expertise their moat in some core activities is literally impenetrable. That's cloud servers and same day delivery network for Amazon and Search/Android/YouTube for Google. \n\nThere is just no viable way for any possible competitor to challenge them because interest rates will never be 0% again. Amazon built a fully in-house logistical powerhouse only rivalled by the US military with free money for years while they hemmoraged cash. Now they are optimising for profit and you can see FCF just blowing though the roof. If there is gonna be a $10 trillion dollar company it's gonna be Amazon.\n\nThere are lots of good Reddit threads about Amazon, I'd say read up on them. But if you can't see it, don't buy it.",
                "relevant_tickers": [
                    "FCF"
                ]
            },
            {
                "comment_date": "2024-04-28T17:40:39",
                "comment_body": "That’s a LOT or words but I have one question for you (because your response indicates you don’t): do you have ANY experience with AWS or Azure or Google Cloud? Do you use their products? Have you ever spent any time setting up infrastructure?\n\nBecause if you haven’t or see the monthly spend of an average small AWS account, you’d understand the moat. Amazon, the consumer side that sells all that stuff, is akin to Microsoft 365 subscriptions for Microsoft. \n\nAmazon wins discretionary spending. \n\nAWS wins infrastructure spend. \n\nAWS will continue to power some of the largest growing companies in the world. \n\nWhat’s not to understand?",
                "relevant_tickers": [
                    "LOT",
                    "ANY"
                ]
            },
            {
                "comment_date": "2024-04-28T17:43:30",
                "comment_body": "If it is a durable moat, it shouldn’t be hard to explain or see.  \n\nI don’t see it for Amazon and I have no intention of buying it.  I see facebook’s moat but I have no intention of buying it.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T17:41:25",
                "comment_body": "Thought it was obvious I don’t, that’s why I’m asking.\n\nEdit: I have had middle market IT VP report to me, but that was before the cloud revolution.  I have enough of an idea of how functions work, but no idea about the tech.  I understand msft moat.\n\nI’ll ask again - what is the moat?  Coding?  Training?  Easily available containerized code?  Knowledge base? \n\nWhat will prevent future competitors from taking the business away?  It shouldn’t be difficult to describe in investor terms.",
                "relevant_tickers": [
                    "IT"
                ]
            },
            {
                "comment_date": "2024-04-28T17:57:04",
                "comment_body": "That's perfectly fine. I wouldn't put Meta or Apple anywhere near the quality of Amazon, MSFT or Google.\n\nHowever I can't refrain from saying you are going to look back at this and say \"why didn't I see it\" in 5 years, guaranteed.\n\nNo ill will behind it tho! Cheers.",
                "relevant_tickers": [
                    "MSFT"
                ]
            },
            {
                "comment_date": "2024-04-28T17:54:58",
                "comment_body": "The entire IT stack spend. But most critically it allows development teams to iterate code quickly by having infrastructure spun up and at their disposal. \n\nIs Azure and Microsoft strong - yes it is! But AWS is the cost and services leader (bigger margins and more offerings to, well, everyone) and they have proven themselves as being secure. \n\n*Microsoft has been breached - if fact it just suffered a major security breach that was tied tot he 2020 Solarwinds hack.",
                "relevant_tickers": [
                    "IT"
                ]
            },
            {
                "comment_date": "2024-04-28T18:01:59",
                "comment_body": "Ok so there is an investment in building something to do something.  Physical or info, it’s the same idea.  You don’t want to climb the hill twice.  And since it’s cheaper to maintain that thing than to rebuild it, you don’t, unless and until it falls into obsolescence or a sufficiently better mousetrap justifies scraping it and starting over.  And, it is difficult to convert from one machine (aws stack) to another (msft or whim ever stack).\n\nThat all tracks - IF it is hard / expensive to move that mountain / factory / network etc.\n\nBut if that stack is built of code (diff languages and I/o links, presumably), what is going to prevent, say Msft, with its GitHub training data, from automating the conversion from one stack to another using LLM?  Making the cost to move the mountain compute not expensive coder labor?",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T18:19:21",
                "comment_body": "Nothing. \n\nAnd when you work with Azure one day you will understand why! ;)\n\nThere is nothing stopping people from adopting Microsoft phones (joke!), Windows, or Microsoft 365 either. But a lot don’t. And for good reason. \n\nFull disclosure - I don’t own $AMZN and have owned $MSFT for over a decade.",
                "relevant_tickers": [
                    "MSFT",
                    "AMZN"
                ]
            },
            {
                "comment_date": "2024-04-28T18:24:42",
                "comment_body": "Well ya, but predicting adoption is tough.  Remember Jobs’ first try at the iPhone?  Disaster.  Then palm pilot came out of nowhere and just as fast was gone.\n\nI hear you saying that Amazon’s moat is vulnerable.  That doesn’t mean it will be breached, but it does mean it isn’t this invulnerable thing that many people seem to think it is.  \n\nThanks for taking the time to explain.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T18:42:54",
                "comment_body": "Funny you say that, because I just started watching the movie BlackBerry this afternoon - RIM now BlackBerry is a great example of an amazing product eventually losing. \n\nI think Amazon would garner a lot of traction if they finally offered a dividend. Like Google, which now offers a different value proposition now they offer a dividend and will do a share buyback (regardless of one’s position on whether they think that’s a good use of corporate capital and earnings), seems market sentiment towards Amazon would change* if a dividend was announced.\n\n*not that investors don’t love (or hate it) and been at recent ATHs.",
                "relevant_tickers": []
            }
        ]
    },
    {
        "post_title": "$CPS Under-Promise, Over-Deliver",
        "post_date": "2024-04-28T18:25:49",
        "post_body": "Cooper-Standard, a leader and global suppliers of sealing systems and component, fuel and brake delivery, and fluid transfer systems was a pre-pandemic money tree cranking out over $8 EPS. During the pandemic, when global light vehicle production was cast into the depths of hell, multiple competitors within the space were forced to close shop; although $CPS remained afloat it did not come out unscathed. Instead, the stock plummeted into freefall, and was down over 90% from it's all-time high. But like my grandma says, when there is blood in the streets, buy real estate. And gentlemen, I have opened $CPS as my largest position and it's my 2024 best-performer pick. Let me explain why.\n\nDuring the pandemic, global light vehicle production volumes fell to a low of 77.6 million units in 2020. Mr. Fu Bingfeng, President of OICA, described the sharp downtrend as \"the worst crisis ever to impact the automotive industry.\" Due to being inherently dependent on light vehicle production, Cooper Standard's top line was obliterated. They went from an untouchable EPS and EBITDA monster to complete stagnation.\n\nWith production annihilated, it is no surprise that eight auto parts suppliers filed for bankruptcy between 2020 and 2021. While Cooper-Standard survived the chaos, revenues declined by over 35%, and shareholders experienced a 90% drop in share price. During the post-pandemic recovery, another major headwind emerged. The UAW strike once again halted light vehicle production for three of Cooper Standard's largest customers. Today, these obstacles have been successfully navigated, and the ascent to reclaim the throne has never been more clear.\n\nLight vehicle production is now on a tear for a multitude of reasons. First, the average age of a vehicle on the road is currently sitting at an all time high of 13.6 years. That coupled with the fact that current domestic auto-inventory sits at 1.4 months (meaning the current stock of automobiles could only supply 1.4 months of sales) creates a huge impetus to start cranking out vehicles. And vehicle production = $CPS profits. Better yet, the vehicle production numbers from Q1 2024 are significantly exceeding consensus predictions. In every month in 2024 to date, vehicle sales have been significantly higher than in 2023. In March alone, vehicle sales were more than 100,000 units greater in 2024 than in 2023.\n\nThis boom in vehicle production and sales has lifted all major automakers than have already reported 1Q earnings, as they continue to beat and raise guidance.\n\nAs far as the financials are concerned, $CPS revenue and adjusted EBITDA show a clear inflection point in 2021, and with leaner costs from restructuring, coupled with the vehicle production turnaround, $CPS is poised to head to the moon gentlemen. Despite the clear path forward, the stock continues to trade \\~85% lower than its ATH. A major reason for this was the conservative guidance set forth by management at the Q4 earnings call, but during the call, the CEO of the company himself said, \"*Clearly, our light vehicle production units and the guidance that we've used for '24, you can see there are -- continue to be a bit conservative, I guess, is how I would describe it.*\" Well, the numbers coming in so far for 24 are far from the conservative estimates put forth by management, and I expect a resounding beat will be the result at their Q1 call in two weeks.\n\nDisclaimer: As mentioned above, I have opened a position in $CPS and as always do your own DD.",
        "relevant_tickers": [
            "DD",
            "CPS"
        ],
        "comments": [
            {
                "comment_date": "2024-04-28T18:27:09",
                "comment_body": "I like",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T21:37:59",
                "comment_body": "Their earnings look great, but are you not worried about their debt?",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T22:31:24",
                "comment_body": "I’m not worried about the debt, here’s why:\n\nOn a top-line basis, their revenues are still 800m below where they were during peak production back in 2018; as production continues to ramp back up, the top line is undoubtedly going to increase.\n\nFurther, operating income and margins continue to improve yoy.  Since 2019, management had made cuts that have contributed $479 million to adjusted EBITDA. They have improved operating efficiencies with smaller fixed cost structure, have higher margins on EVs due to them requiring 20% more content per vehicle, and renegotiated contracts with customers.  In short, they’re making more money on each car manufactured, we were just waiting for production to ramp up (which the Q1 vehicle sale numbers so far suggest has already started to happen.).  These sales numbers are approximating 2018 levels DESPITE interest rates remaining high, imagine what car sale volume will look like once rates are.\n\nThe debt is primarily long-term debt, which allows Cooper Standard to ride the tailwinds current in place within the automotive industry and pay back that debt as the balance sheet continues to strengthen.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T22:32:28",
                "comment_body": "Let me know what you think",
                "relevant_tickers": []
            }
        ]
    },
    {
        "post_title": "Beaten-Down Beer Stocks Part 2: Molson Coors. $TAP Full DCF Valuation and Discussion.",
        "post_date": "2024-04-28T20:55:05",
        "post_body": "This one was more difficult. There are 4 share classes and I had to figure out why Yahoo Finance didn't account for non-current leases. I put a ton of effort into this one. What do you think?",
        "relevant_tickers": [
            "DCF",
            "TAP"
        ],
        "comments": []
    },
    {
        "post_title": "Stock (YRD) Yiren Digital Ltd. Overlooked and misunderstood ",
        "post_date": "2024-04-29T00:21:53",
        "post_body": "YRD is a Chinese company that operates in three different segments, financial services, insurance, and a online market place. With a PE currently sitting at 1.5, the market has heavily beaten down this stock as it operates in multiple challenging segments and areas. First of all, it's located in China. Which we all already know how hard just that can make a stock tumble. Two, it used to operates solely in the online consumer finance market place. Which several years ago, suffered through heavy regulation from the CCP. Third, it is a subsidary of creditease, who old a majority position of the shares. Even thought these are some very clear big risks, I do believe the upside is quite big as well.\n\nThe upside:\nThe margin of safety is quite big, the company has 0 debt, and hold a cash pile of 800 million USD, which is almost two times larger than the companies market cap.\nThe PE is 1.5 - however, over the last year, with the addition of its new insurance and online market place units, growth has been over 30% per quarter, and they have began using the cash on hand to invest into buying similar companies around the southern Asian area.\nThe growth potential is there, with all of their three segments posting solid growth in the past year, and forecast for the next year being growth of over 20%\nROIC over the last two years has been 20%+, and it is likely to continue next year\nShare repushases have began, and with the huge amount of cash on hand, and extremely low PE. Repushases would be a extremely effective tool .\n\nThe big risk:\nThe only real risk here is China. They're unpredictable, and have been a huge roadblock Chinese companies for years now.\n\nLooks into it yourself! Any other options would be greatly appreciated.\n\n\n",
        "relevant_tickers": [
            "YRD",
            "ROIC"
        ],
        "comments": []
    },
    {
        "post_title": "My AI-Powered trading platform combines value investing with algorithmic trading",
        "post_date": "2024-04-28T10:44:00",
        "post_body": "Hello!\n\nMy name is Austin. Since I started my MS in software engineering at Carnegie Mellon, I've been passionate about algorithmic trading. Over the years, [I've worked on (and released) and open-source algorithmic trading platform called NextTrade](https://github.com/austin-starks/NextTrade).\n\nWhen working on NextTrade, I made a few critical mistakes. While I won't go over them in detail, these mistakes range from:\n\n* Making NextTrade too slow \n* Not making it configurable enough \n* Making it far too niche\n\nSince then, I've been developing a new platform called [NexusTrade](https://nexustrade.io/). Unlike NextTrade, NexusTrade is freemium. I've done a lot of work making it suitable for all types of traders and investors. Some specfic features that would interest this group include\n\n* [Algorithmic trading using fundamental data](https://medium.com/p/95b0267a0dba)\n* [AI-Powered Stock Screener](https://nexustrade.io/blog/new-feature-launch--an-ai-feature-that-no-other-investing-platform-has-20240213)\n* [More traditional, UI-Based Simple stock screener](https://nexustrade.io/blog/i-just-created-the-worlds-best-stock-screener-20240404)\n\nThese features make it really easy to find value stocks and apply them to your algorithmic trading strategies.\n\n[I wanted to share my thoughts on making NexusTrade a freemium app.](https://medium.com/p/120ce4c90e3c) I think that by it being free-to-try, it can encourage the skeptics to actually try it out and see their results. However, it's also not cheap to host this platform, and I need to strike a balance between usefulness and cost-effectiveness.\n\n[My full thoughts are here.](https://medium.com/p/120ce4c90e3c) I'm really curious to get some feedback on how algorithmic trading can be applied to value investing, and what particular features are you looking out for in such a platform.",
        "relevant_tickers": [
            "MS",
            "AI",
            "UI"
        ],
        "comments": [
            {
                "comment_date": "2024-04-28T13:24:57",
                "comment_body": "The concept looks really promising, I wish you a lot of success with it ! Which API are you using for the market datas ?",
                "relevant_tickers": [
                    "API"
                ]
            },
            {
                "comment_date": "2024-04-28T13:29:20",
                "comment_body": "Thank you! I’m using a combination of yahoo finance and SimFin",
                "relevant_tickers": []
            }
        ]
    },
    {
        "post_title": "Why is it important to evaluate a company without the influence of leverage",
        "post_date": "2024-04-28T17:32:58",
        "post_body": "Hey guys, I'm a beginner investor who just started learning investment systematically. I was learning about NOPAT, and I know that NOPAT allows evaluating a company's performance without the influence of leverage. \n\n&#x200B;\n\nI'm confused on why is the influence of leverage important here. What are some key difference between a company that with leverage, and without? \n\n&#x200B;\n\nThanks!",
        "relevant_tickers": [],
        "comments": [
            {
                "comment_date": "2024-04-28T17:48:44",
                "comment_body": "Because un levered returns are ideal. Tax strategy aside, the goal of a company is to return or appreciate capital for shareholders.\n\nThe more dollars allocated into financing cash flows is less value to shareholders.\n\nI do private company valuations. Too many people (managers) are unable to actually use financing for generating returns beyond the leverage points.\n\nTwo clients. Same level of revenue, operating structure, etc. One is levered with 19% of every dollar to debt service. The other is debt free and is able to grow while also distributing consistently 28-30% net income to owners.\n\nWhich company is more valuable?",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T19:07:04",
                "comment_body": "In simple terms leverage can increase returns so in a company that has the option to increase leverage is worth more.\n\n\nImagine, simply, that there are two identical companies. Both companies can buy factories with a 15% return and borrow debt at 7%.\n\nCompany A is debt free and buys factory 1 with cash and earns 15%.\n\nCompany B also buys factory 1 with cash earning 15% but also factory 2, with debt, earning 8% (15%-7%); in total earning 23%.\n\nWould you say that company B is worth more because it earns 23% if company A could take on debt and buy a factory tomorrow? No, that is why you need to look at unlevered returns for an apples to apples comparison. Also, a large investor (e.g. private equity) can simply buy out the company and change the capital structure. Hope this helps.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T19:45:39",
                "comment_body": "Leverage (i.e. debt ) can amplify profits or losses) and also adds risk of bankruptcy.  Looking at the company without the distortion of debt can help compare two different investment opportunities.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T19:51:32",
                "comment_body": "Just to add to what others have said:\n\n1) it’s so that you can evaluate the business on its own merits.  Financial engineering is a real thing, compare a property rental company where they can buy assets with either 100% cash or 10% cash and 90% debt - the debt holders only receive a fixed income while any profits above this go directly to the shareholders after taxes, which means the return on investment can be hugely affected by the debt levels.  Therefore the merits of the business itself can be distorted by debt.\n\n2) It gives a clearer picture on how much debt a company can repay.\n\n3) Debt can distort the apparent value of a company, especially when using an earnings multiple as a valuation technique (e.g. a PE ratio). There are a few different ways that this could cause an error in judgement here: a) say EBIT is $100 and interest $90 leaving a profit of $8 after tax (at 20%), if companies in this industry are usually valued at a PE of 15, then you might think that the company should be worth $120 ($8 x 15).  But what if the company only has a year or two left on its loans?   Then the value would be radically different.  b) Another scenario, using the same figures above, is what if the company is growing very rapidly?  Using the same multiple to value both the business and the debt would clearly be an error in valuation. i.e. if earnings before tax in the following year is $200, the year after that $400, and the year after that $800, and if the debt and interest rates have remained unchanged at  just $90 interest per year, then applying an earnings multiple to the after interest figure would probably under value the company.\n\n4) A company is made up of the business itself (the assets, working capital, staff etc) and how it is financed (capital structure).  Debt is very easy to place a value on and usually the balance sheet figure is sufficient, though there can be exceptions that I won’t get into.  So why complicate your evaluation of a business when you can simply deduct the debt at the end of your evaluation?  Having debt in the evaluation complicates things unnecessarily.  Again, there are exceptions, especially if the company has either significant debt - where a closer examination of the cash flows would be required, or very little debt - could be ignored for simplicity purposes.",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T20:26:39",
                "comment_body": "Is it the second one?",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T21:31:48",
                "comment_body": "This explanation is very clear, thank you!",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T21:56:30",
                "comment_body": "This makes a lot of sense, thank you!",
                "relevant_tickers": []
            }
        ]
    },
    {
        "post_title": "No Reinvestment Growth Projection",
        "post_date": "2024-04-28T18:34:34",
        "post_body": "Hey everyone, for anyone who has experienced this what has been your solution? I am evaluating a royalty company that due to the nature of their operation does not have any capital expenditure so I am finding it particularly difficult to project growth. Note, that the royalties they own are private companies so no insight there on reinvestments by the individual business segments. Cheers. ",
        "relevant_tickers": [],
        "comments": []
    },
    {
        "post_title": "Which  corporate bonds should I buy",
        "post_date": "2024-04-28T22:33:51",
        "post_body": "Hello everyone, I am quite new to understanding the bond market, and I believe approximately 20% of my portfolio should consist of bonds. Given the current market scenario (high-interest rates), I would like to inquire if it is advisable to invest in corporate bonds? If so, could you kindly recommend some suitable options? Additionally, I am contemplating whether to adopt a step-ladder pattern by purchasing bonds with varying maturities, such as 2 years, 5 years, 7 years, and 10 years, or simply focus on 10-year bonds. I would greatly appreciate your insights, as I am in my 40s and seeking to make informed investment decisions.\n\nThank you.",
        "relevant_tickers": [],
        "comments": [
            {
                "comment_date": "2024-04-28T23:03:42",
                "comment_body": "This probably isn't the sub for bonds. Honestly, HYSA or 10 year T bonds",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-28T23:47:24",
                "comment_body": "You shouldn't lol, they not good",
                "relevant_tickers": []
            },
            {
                "comment_date": "2024-04-29T00:31:59",
                "comment_body": "Short duration t-bills. Ladder them so they can work as an emergency fund, so you don’t need to sell stocks in a down market. Or if you get laid off for a while.",
                "relevant_tickers": []
            }
        ]
    },
    {
        "post_title": "Anglo-American PLC",
        "post_date": "2024-04-28T14:58:39",
        "post_body": "I've been acquiring shares of the Anglo-American ADR, mostly at less than $14 per share. With BHP's recent bid being rejected and the pe firm Elliot Management announcing a billion-dollar stake in the company, it seems likely that the stock is set to run with a future offer having to be significantly more than the initial bid. However, there are still some uncertainties, particularly regarding the potential need for Anglo American to spin off significant portions of the company. Even at $16.40, the shares still appear undervalued to me given an imminent sale. I'm curious to hear if anyone else has any thoughts on this.\n\nhttps://www.reuters.com/markets/deals/activist-investor-elliott-builds-1-bln-anglo-american-stake-bloomberg-news-2024-04-26/\n\nhttps://www.reuters.com/markets/deals/bhp-consider-improved-anglo-proposal-after-bid-was-rejected-bloomberg-news-2024-04-27/",
        "relevant_tickers": [
            "BHP"
        ],
        "comments": [
            {
                "comment_date": "2024-04-28T15:21:00",
                "comment_body": "I bought shares of Anglo American Platinum when the share price drop when BHP announced the offer. Not sure what will happen if they decide to take up a offer in the future looks like they only want Anglo America.",
                "relevant_tickers": [
                    "BHP"
                ]
            }
        ]
    }
]