[
    {
        "post_title": "[Weekly Megathread] Markets and Value Stock Ideas, Week of April 29, 2024",
        "post_date": "2024-04-29T00:00:15",
        "post_body": "What stocks are on your radar this week?\n\nWhat's in the news that's affecting the market?\n\nCelebrate your successes, rue your losses, or just chat with your fellow Value redditors!\n\nTake everything here with a grain of salt! We suggest checking other users' posting/commenting history before following advice or stock recommendations.  Watch out for shill accounts that pump the same stock all over Reddit, or have many posts/comments deleted in other investing subreddits. Stay safe!\n\n*(New Weekly Megathreads are posted every Monday at 0600 GMT.)*",
        "relevant_tickers": [],
        "comments": [
            {
                "carlos_date": "2024-04-29T00:19:54",
                "comment_body": "CCB. It's a bank stock that plays the BaaS game, and is making an increasing portion of revenue from non interest sources. 500M market cap based out of the Washington area. The bank has good management and the launching of the BaaS service has supercharged growth in the business.",
                "relevant_tickers": [
                    "CCB"
                ]
            }
        ]
    },
    {
        "post_title": "Large-Growth Stocks Are Overvalued. Small-Value Stocks Are Undervalued",
        "post_date": "2024-04-28T09:54:04",
        "post_body": "The most important takeaway is that valuations are a proxy for long-term expected returns. Thus, being mindful of them should lead to better outcomes. At the same time, we must recognize that over the short term, valuations have little predictive value as to returns.\n\nhttps://www.morningstar.com/portfolios/large-growth-stocks-are-overvalued-small-value-stocks-are-undervalued-heres-why-it-matters",
        "relevant_tickers": [],
        "comments": [
            {
                "carlos_date": "2024-04-28T10:25:14",
                "comment_body": "I'm in both. Come at me, market.\n\nThough it didn't happen deliberately. Turns out some good companies are large cap growth, other good companies are small cap value. Just turned out that way.",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-28T12:35:22",
                "comment_body": "Google is about fairly valued after Q1 earnings. Amazon is still undervalued. A company with a 1,9 trillion market cap is not expensive if they generate 100 billion in FCF.\n\nBuy Amazon and never sell. You won't regret it.",
                "relevant_tickers": [
                    "FCF"
                ]
            },
            {
                "carlos_date": "2024-04-28T13:51:36",
                "comment_body": "Im almost exclusively in nano, micro, and small caps. The value discrepancy is borderline unbelievable. Good luck finding a growing large cap tech company that trades under 1.0 P/S.\n\nAfter being in these for a couple years I’ve also noticed they’re subject to huge moves based on cyclical capital rotations. I’ll buy something cheap and may have to wait a year, but it’ll go up 200% in a few months for seemingly no real reason.",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-28T17:50:59",
                "comment_body": "Only NVDA probably is overvalued",
                "relevant_tickers": [
                    "NVDA"
                ]
            },
            {
                "carlos_date": "2024-04-28T11:32:07",
                "comment_body": "Clarivate",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-28T19:01:15",
                "comment_body": "I feel we have to factor in the financial strength, indicated by credit rating for example, when talking about value. Otherwise, it's meaningless. Stocks from lowly rated companies should be cheaper than a stronger company.",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-28T20:22:19",
                "comment_body": "Market cap doesn't really matter. A 100 million dollar stock can be just as undervalued as a 100 billion dollar stock. The difference is that large caps are generally less likely to be undervalued, but when they are, you bet your ass I'm buying in.",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-28T10:22:20",
                "comment_body": "[deleted]",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-28T12:02:17",
                "comment_body": "Thanks.",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-28T10:15:19",
                "comment_body": "So what?....",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-28T10:02:22",
                "comment_body": "No. Yes.",
                "relevant_tickers": []
            }
        ]
    },
    {
        "post_title": "$CPS Under-Promise, Over-Deliver",
        "post_date": "2024-04-28T18:25:49",
        "post_body": "Cooper-Standard, a leader and global suppliers of sealing systems and component, fuel and brake delivery, and fluid transfer systems was a pre-pandemic money tree cranking out over $8 EPS. During the pandemic, when global light vehicle production was cast into the depths of hell, multiple competitors within the space were forced to close shop; although $CPS remained afloat it did not come out unscathed. Instead, the stock plummeted into freefall, and was down over 90% from it's all-time high. But like my grandma says, when there is blood in the streets, buy real estate. And gentlemen, I have opened $CPS as my largest position and it's my 2024 best-performer pick. Let me explain why.\n\nDuring the pandemic, global light vehicle production volumes fell to a low of 77.6 million units in 2020. Mr. Fu Bingfeng, President of OICA, described the sharp downtrend as \"the worst crisis ever to impact the automotive industry.\" Due to being inherently dependent on light vehicle production, Cooper Standard's top line was obliterated. They went from an untouchable EPS and EBITDA monster to complete stagnation.\n\nWith production annihilated, it is no surprise that eight auto parts suppliers filed for bankruptcy between 2020 and 2021. While Cooper-Standard survived the chaos, revenues declined by over 35%, and shareholders experienced a 90% drop in share price. During the post-pandemic recovery, another major headwind emerged. The UAW strike once again halted light vehicle production for three of Cooper Standard's largest customers. Today, these obstacles have been successfully navigated, and the ascent to reclaim the throne has never been more clear.\n\nLight vehicle production is now on a tear for a multitude of reasons. First, the average age of a vehicle on the road is currently sitting at an all time high of 13.6 years. That coupled with the fact that current domestic auto-inventory sits at 1.4 months (meaning the current stock of automobiles could only supply 1.4 months of sales) creates a huge impetus to start cranking out vehicles. And vehicle production = $CPS profits. Better yet, the vehicle production numbers from Q1 2024 are significantly exceeding consensus predictions. In every month in 2024 to date, vehicle sales have been significantly higher than in 2023. In March alone, vehicle sales were more than 100,000 units greater in 2024 than in 2023.\n\nThis boom in vehicle production and sales has lifted all major automakers than have already reported 1Q earnings, as they continue to beat and raise guidance.\n\nAs far as the financials are concerned, $CPS revenue and adjusted EBITDA show a clear inflection point in 2021, and with leaner costs from restructuring, coupled with the vehicle production turnaround, $CPS is poised to head to the moon gentlemen. Despite the clear path forward, the stock continues to trade \\~85% lower than its ATH. A major reason for this was the conservative guidance set forth by management at the Q4 earnings call, but during the call, the CEO of the company himself said, \"*Clearly, our light vehicle production units and the guidance that we've used for '24, you can see there are -- continue to be a bit conservative, I guess, is how I would describe it.*\" Well, the numbers coming in so far for 24 are far from the conservative estimates put forth by management, and I expect a resounding beat will be the result at their Q1 call in two weeks.\n\nDisclaimer: As mentioned above, I have opened a position in $CPS and as always do your own DD.",
        "relevant_tickers": [
            "CPS",
            "DD"
        ],
        "comments": [
            {
                "carlos_date": "2024-04-28T18:27:09",
                "comment_body": "I like",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-28T21:37:59",
                "comment_body": "Their earnings look great, but are you not worried about their debt?",
                "relevant_tickers": []
            }
        ]
    },
    {
        "post_title": "Beaten-Down Beer Stocks Part 2: Molson Coors. $TAP Full DCF Valuation and Discussion.",
        "post_date": "2024-04-28T20:55:05",
        "post_body": "This one was more difficult. There are 4 share classes and I had to figure out why Yahoo Finance didn't account for non-current leases. I put a ton of effort into this one. What do you think?",
        "relevant_tickers": [
            "TAP",
            "DCF"
        ],
        "comments": []
    },
    {
        "post_title": "My AI-Powered trading platform combines value investing with algorithmic trading",
        "post_date": "2024-04-28T10:44:00",
        "post_body": "Hello!\n\nMy name is Austin. Since I started my MS in software engineering at Carnegie Mellon, I've been passionate about algorithmic trading. Over the years, [I've worked on (and released) and open-source algorithmic trading platform called NextTrade](https://github.com/austin-starks/NextTrade).\n\nWhen working on NextTrade, I made a few critical mistakes. While I won't go over them in detail, these mistakes range from:\n\n* Making NextTrade too slow \n* Not making it configurable enough \n* Making it far too niche\n\nSince then, I've been developing a new platform called [NexusTrade](https://nexustrade.io/). Unlike NextTrade, NexusTrade is freemium. I've done a lot of work making it suitable for all types of traders and investors. Some specfic features that would interest this group include\n\n* [Algorithmic trading using fundamental data](https://medium.com/p/95b0267a0dba)\n* [AI-Powered Stock Screener](https://nexustrade.io/blog/new-feature-launch--an-ai-feature-that-no-other-investing-platform-has-20240213)\n* [More traditional, UI-Based Simple stock screener](https://nexustrade.io/blog/i-just-created-the-worlds-best-stock-screener-20240404)\n\nThese features make it really easy to find value stocks and apply them to your algorithmic trading strategies.\n\n[I wanted to share my thoughts on making NexusTrade a freemium app.](https://medium.com/p/120ce4c90e3c) I think that by it being free-to-try, it can encourage the skeptics to actually try it out and see their results. However, it's also not cheap to host this platform, and I need to strike a balance between usefulness and cost-effectiveness.\n\n[My full thoughts are here.](https://medium.com/p/120ce4c90e3c) I'm really curious to get some feedback on how algorithmic trading can be applied to value investing, and what particular features are you looking out for in such a platform.",
        "relevant_tickers": [
            "UI",
            "AI",
            "MS"
        ],
        "comments": [
            {
                "carlos_date": "2024-04-28T13:24:57",
                "comment_body": "The concept looks really promising, I wish you a lot of success with it ! Which API are you using for the market datas ?",
                "relevant_tickers": [
                    "API"
                ]
            }
        ]
    },
    {
        "post_title": "Why is it important to evaluate a company without the influence of leverage",
        "post_date": "2024-04-28T17:32:58",
        "post_body": "Hey guys, I'm a beginner investor who just started learning investment systematically. I was learning about NOPAT, and I know that NOPAT allows evaluating a company's performance without the influence of leverage. \n\n&#x200B;\n\nI'm confused on why is the influence of leverage important here. What are some key difference between a company that with leverage, and without? \n\n&#x200B;\n\nThanks!",
        "relevant_tickers": [],
        "comments": [
            {
                "carlos_date": "2024-04-28T17:48:44",
                "comment_body": "Because un levered returns are ideal. Tax strategy aside, the goal of a company is to return or appreciate capital for shareholders.\n\nThe more dollars allocated into financing cash flows is less value to shareholders.\n\nI do private company valuations. Too many people (managers) are unable to actually use financing for generating returns beyond the leverage points.\n\nTwo clients. Same level of revenue, operating structure, etc. One is levered with 19% of every dollar to debt service. The other is debt free and is able to grow while also distributing consistently 28-30% net income to owners.\n\nWhich company is more valuable?",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-28T19:07:04",
                "comment_body": "In simple terms leverage can increase returns so in a company that has the option to increase leverage is worth more.\n\n\nImagine, simply, that there are two identical companies. Both companies can buy factories with a 15% return and borrow debt at 7%.\n\nCompany A is debt free and buys factory 1 with cash and earns 15%.\n\nCompany B also buys factory 1 with cash earning 15% but also factory 2, with debt, earning 8% (15%-7%); in total earning 23%.\n\nWould you say that company B is worth more because it earns 23% if company A could take on debt and buy a factory tomorrow? No, that is why you need to look at unlevered returns for an apples to apples comparison. Also, a large investor (e.g. private equity) can simply buy out the company and change the capital structure. Hope this helps.",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-28T19:45:39",
                "comment_body": "Leverage (i.e. debt ) can amplify profits or losses) and also adds risk of bankruptcy.  Looking at the company without the distortion of debt can help compare two different investment opportunities.",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-28T19:51:32",
                "comment_body": "Just to add to what others have said:\n\n1) it’s so that you can evaluate the business on its own merits.  Financial engineering is a real thing, compare a property rental company where they can buy assets with either 100% cash or 10% cash and 90% debt - the debt holders only receive a fixed income while any profits above this go directly to the shareholders after taxes, which means the return on investment can be hugely affected by the debt levels.  Therefore the merits of the business itself can be distorted by debt.\n\n2) It gives a clearer picture on how much debt a company can repay.\n\n3) Debt can distort the apparent value of a company, especially when using an earnings multiple as a valuation technique (e.g. a PE ratio). There are a few different ways that this could cause an error in judgement here: a) say EBIT is $100 and interest $90 leaving a profit of $8 after tax (at 20%), if companies in this industry are usually valued at a PE of 15, then you might think that the company should be worth $120 ($8 x 15).  But what if the company only has a year or two left on its loans?   Then the value would be radically different.  b) Another scenario, using the same figures above, is what if the company is growing very rapidly?  Using the same multiple to value both the business and the debt would clearly be an error in valuation. i.e. if earnings before tax in the following year is $200, the year after that $400, and the year after that $800, and if the debt and interest rates have remained unchanged at  just $90 interest per year, then applying an earnings multiple to the after interest figure would probably under value the company.\n\n4) A company is made up of the business itself (the assets, working capital, staff etc) and how it is financed (capital structure).  Debt is very easy to place a value on and usually the balance sheet figure is sufficient, though there can be exceptions that I won’t get into.  So why complicate your evaluation of a business when you can simply deduct the debt at the end of your evaluation?  Having debt in the evaluation complicates things unnecessarily.  Again, there are exceptions, especially if the company has either significant debt - where a closer examination of the cash flows would be required, or very little debt - could be ignored for simplicity purposes.",
                "relevant_tickers": []
            }
        ]
    },
    {
        "post_title": "No Reinvestment Growth Projection",
        "post_date": "2024-04-28T18:34:34",
        "post_body": "Hey everyone, for anyone who has experienced this what has been your solution? I am evaluating a royalty company that due to the nature of their operation does not have any capital expenditure so I am finding it particularly difficult to project growth. Note, that the royalties they own are private companies so no insight there on reinvestments by the individual business segments. Cheers. ",
        "relevant_tickers": [],
        "comments": []
    },
    {
        "post_title": "Stock (YRD) Yiren Digital Ltd. Overlooked and misunderstood ",
        "post_date": "2024-04-29T00:21:53",
        "post_body": "YRD is a Chinese company that operates in three different segments, financial services, insurance, and a online market place. With a PE currently sitting at 1.5, the market has heavily beaten down this stock as it operates in multiple challenging segments and areas. First of all, it's located in China. Which we all already know how hard just that can make a stock tumble. Two, it used to operates solely in the online consumer finance market place. Which several years ago, suffered through heavy regulation from the CCP. Third, it is a subsidary of creditease, who old a majority position of the shares. Even thought these are some very clear big risks, I do believe the upside is quite big as well.\n\nThe upside:\nThe margin of safety is quite big, the company has 0 debt, and hold a cash pile of 800 million USD, which is almost two times larger than the companies market cap.\nThe PE is 1.5 - however, over the last year, with the addition of its new insurance and online market place units, growth has been over 30% per quarter, and they have began using the cash on hand to invest into buying similar companies around the southern Asian area.\nThe growth potential is there, with all of their three segments posting solid growth in the past year, and forecast for the next year being growth of over 20%\nROIC over the last two years has been 20%+, and it is likely to continue next year\nShare repushases have began, and with the huge amount of cash on hand, and extremely low PE. Repushases would be a extremely effective tool .\n\nThe big risk:\nThe only real risk here is China. They're unpredictable, and have been a huge roadblock Chinese companies for years now.\n\nLooks into it yourself! Any other options would be greatly appreciated.\n\n\n",
        "relevant_tickers": [
            "ROIC",
            "YRD"
        ],
        "comments": []
    },
    {
        "post_title": "How retail ETF investors screw themselves",
        "post_date": "2024-04-28T23:46:45",
        "post_body": "",
        "relevant_tickers": [],
        "comments": [
            {
                "carlos_date": "2024-04-28T23:59:15",
                "comment_body": "Stupid headline.. basically it says if idiots use leveraged or inverse ETFs they underperform. Normal ETFs are fine.",
                "relevant_tickers": []
            }
        ]
    },
    {
        "post_title": "Which  corporate bonds should I buy",
        "post_date": "2024-04-28T22:33:51",
        "post_body": "Hello everyone, I am quite new to understanding the bond market, and I believe approximately 20% of my portfolio should consist of bonds. Given the current market scenario (high-interest rates), I would like to inquire if it is advisable to invest in corporate bonds? If so, could you kindly recommend some suitable options? Additionally, I am contemplating whether to adopt a step-ladder pattern by purchasing bonds with varying maturities, such as 2 years, 5 years, 7 years, and 10 years, or simply focus on 10-year bonds. I would greatly appreciate your insights, as I am in my 40s and seeking to make informed investment decisions.\n\nThank you.",
        "relevant_tickers": [],
        "comments": [
            {
                "carlos_date": "2024-04-28T23:03:42",
                "comment_body": "This probably isn't the sub for bonds. Honestly, HYSA or 10 year T bonds",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-28T23:47:24",
                "comment_body": "You shouldn't lol, they not good",
                "relevant_tickers": []
            },
            {
                "carlos_date": "2024-04-29T00:31:59",
                "comment_body": "Short duration t-bills. Ladder them so they can work as an emergency fund, so you don’t need to sell stocks in a down market. Or if you get laid off for a while.",
                "relevant_tickers": []
            }
        ]
    }
]