{
    "post_title": "[Weekly Megathread] Markets and Value Stock Ideas, Week of April 22, 2024",
    "post_date": "2024-04-22T00:00:14",
    "post_body": "What stocks are on your radar this week?\n\nWhat's in the news that's affecting the market?\n\nCelebrate your successes, rue your losses, or just chat with your fellow Value redditors!\n\nTake everything here with a grain of salt! We suggest checking other users' posting/commenting history before following advice or stock recommendations.  Watch out for shill accounts that pump the same stock all over Reddit, or have many posts/comments deleted in other investing subreddits. Stay safe!\n\n*(New Weekly Megathreads are posted every Monday at 0600 GMT.)*",
    "relevant_tickers": [],
    "comments": [
        {
            "comment_date": 1713860892.0,
            "comment_body": "Dedicare is the Nordic region's largest provider of temporary healthcare and social work staff. Great returns on capital, cash generative, growing, and at an 11% FCF Yield on last three years' average free cash flow. [https://open.substack.com/pub/johanlunau/p/dedicare-ab-dedi?r=u2hy6&utm\\_campaign=post&utm\\_medium=web&showWelcomeOnShare=true](https://open.substack.com/pub/johanlunau/p/dedicare-ab-dedi?r=u2hy6&utm_campaign=post&utm_medium=web&showWelcomeOnShare=true)",
            "relevant_tickers": [
                "FCF"
            ]
        },
        {
            "comment_date": 1713793213.0,
            "comment_body": "Is alibaba stock overhyped?\n\nFor the past couple of months/year yoh could argue that alibaba is the most speculative value stock with even names as michael burry holding on to it for a very long time.\n\nTheir eps and p/e ratio seem around industry average but ev/ebitda seems better then competitors.\n\nHaving knockbacks because of chinese regulations i believe.\n\nOverall i just don understand the hype around the stock \n\nIf anyone could please explain some more to me because i really need to learn how and why this would be a good investment",
            "relevant_tickers": []
        },
        {
            "comment_date": 1713895638.0,
            "comment_body": "Does Any one here looks at Retained earnings as a metric?  I beleive its very underrated metric.  **Retained earnings** represent the cumulative total of earnings that a company has yet to pay to shareholders and is found on the Balance Sheet.  While the number itself is less important - what is important to me is the overall trajectory of retained earnings - i.e its growth and growth rate.  I want to see the retained earning growing from year to year hopefully at a rapid pace.  Typically I look at least 5 years of retained earnings.  It can tell us a lot about the compounding ability of a stock.",
            "relevant_tickers": []
        },
        {
            "comment_date": 1713935257.0,
            "comment_body": "Is whalewisdom down or am I just doing it wrong?",
            "relevant_tickers": []
        },
        {
            "comment_date": 1713989987.0,
            "comment_body": "The TPR and CPRI drams is getting interesting. Capri at $35 is getting quite interesting either as a stand alone or if it gets tagged by tpr. CPRI trades at .77 times sales and has 65% gross margins implying that net could be in the 15% range in time if tpr takes over or the CO gets its act together. If cpri trades down to $30 its a no brainier to me esp if you have time and don't mind collecting a 4% dividend while you wait it out.",
            "relevant_tickers": [
                "TPR",
                "CPRI"
            ]
        },
        {
            "comment_date": 1714066990.0,
            "comment_body": "With an incoming resource-expansion & discovery-focused exploration program at a 140Moz silver resource I'm keeping an eye on DV - with three rigs turning for an initial 25,000m diamond drill program, they're on track for some solid growth: [https://new.reddit.com/r/WallStreetbetsELITE/comments/1cc2gd4/three\\_rigs\\_turning\\_for\\_initial\\_25000m\\_diamond/](https://new.reddit.com/r/WallStreetbetsELITE/comments/1cc2gd4/three_rigs_turning_for_initial_25000m_diamond/)",
            "relevant_tickers": [
                "DV"
            ]
        },
        {
            "comment_date": 1714142646.0,
            "comment_body": "Look into MIND CTI stock.\n\nStable(but declining earnings), cash on balance sheet 2 x total liabilities. ROE 20%+ Only downside is low volume. Offers dividends yearly and stock seems to move downwards as it trades ex-dividend. Ticker : MNDO.\n\nBusiness: Provides billing solutions for mobile carriers, call accounting and messaging services(mass marketing)",
            "relevant_tickers": [
                "MNDO",
                "MIND"
            ]
        },
        {
            "comment_date": 1714162383.0,
            "comment_body": "Charter (CHTR) is looking like a steal or a dying cable company.  PE of only 9 - priced like a no growth stock.  Yet company has grown operating earnings in the double digit over 3, 5 and 10 years.",
            "relevant_tickers": [
                "CHTR"
            ]
        }
    ]
}